//TIP To <b>Run</b> code, press <shortcut actionId="Run"/> or
// click the <icon src="AllIcons.Actions.Execute"/> icon in the gutter.
public class Main {
    public static void main(String[] args) {
        //1. Создать класс "Сотрудник" с полями: ФИО, должность, email, телефон, зарплата, возраст.
        //Конструктор класса должен заполнять эти поля при создании объекта.
        //Внутри класса «Сотрудник» написать метод, который выводит информацию об объекте в консоль.
        System.out.println("\n\n№1**********************************************************");
        Сотрудник сотрудник1 = new Сотрудник("Петров Петр Петрович", "аудитор", "petrov@yahoo.ru", "(800)123-45-67", 100000, 40);
        сотрудник1.info();

        //№2*******************************************************************************************************
        //2. Создать массив из 5 сотрудников.
        //Пример:
        //// вначале объявляем массив объектов
        //Person[] persArray = new Person[5];
        //// потом для каждой ячейки массива задаем объект
        //persArray[0] = new Person("Ivanov Ivan", "Engineer",
        //               "ivivan@mailbox.com", "892312312", 30000, 30);
        //persArray[1] = new Person(...);
        //...persArray[4] = new Person(...);
        System.out.println("\n\n№2**********************************************************");
        Сотрудник[] sotrArray = new Сотрудник[5];
        sotrArray[0] = new Сотрудник("Петров Петр Петрович", "Аудитор", "petrov@mailbox.com", "(800)1234567", 100000, 40);
        sotrArray[1] = new Сотрудник("Иванов Иван Иванович", "Инженер", "ivivan@mailbox.com", "(800)1312312", 55000, 50);
        sotrArray[2] = new Сотрудник("Сидоров Сидор Сидорович", "Специалист", "sidorov@mailbox.com", "(800)1312312", 60000, 60);
        sotrArray[3] = new Сотрудник("Смирнов Мирон Миронович", "Консультант", "smirnov@mailbox.com", "(800)1312312", 45000, 33);
        sotrArray[4] = new Сотрудник("Георгиев Георгий Георгиевич", "Менеджер", "georgiev@mailbox.com", "(800)1312312", 75000, 29);
        for (int i=0; i<sotrArray.length; i++) {
            System.out.println("\nСотрудник №"+(i+1)+"**********************************************************");
            sotrArray[i].info();
        }
        //3. Создать класс Park с внутренним классом, с помощью объектов которого
        //можно хранить информацию об аттракционах, времени их работы и стоимости.
    }
}